// 无常 = [灵芝,凌霄花,灵芝,天仙藤,人参,何首乌,凌霄花,灵芝,灵芝];

// 大力 = [何首乌,凌霄花,盘龙参,盘龙参,巨骨舌鱼,人参,人参,人参,天仙藤];//20%的攻击，持续20分钟

// 石龟 = [天仙藤,人参,凌霄花,人参,何首乌,盘龙参,何首乌,盘龙参,人参];//增加你20%的防御，持续20分钟

// 凝神 = [天仙藤,盘龙参,盘龙参,何首乌,灵芝,凌霄花,盘龙参,凌霄花,银龙鱼];//增加你20%的命中，持续20分钟

// 归心 = [天仙藤,灵芝,天仙藤,凌霄花,盘龙参,凌霄花,凌霄花,何首乌,天仙藤];

// 风行 = [天仙藤,灵芝,盘龙参,何首乌,人参,凌霄花,灵芝,盘龙参,帝王老虎魟];

// 蕴象丸 = [灵芝,人参,何首乌,何首乌,盘龙参,凌霄花,盘龙参,凌霄花,天仙藤];//增加你50%的打坐效率，持续60分钟



// 玄冰 = [灵芝,天仙藤,凌霄花,何首乌,天仙藤,天仙藤,何首乌,灵芝,黑龙鱼];

// 玄灵 = [天仙藤,人参,巨骨舌鱼,盘龙参,人参,灵芝,人参,凌霄花,银龙鱼];


let 人参 = `<span style="color:purple">人参</span>`;
let 何首乌 = `<span style="color:purple">何首乌</span>`;
let 凌霄花 = `<span style="color:purple">凌霄花</span>`;

let 灵芝 = `<span style="color:orange">灵芝</span>`;
let 盘龙参 = `<span style="color:orange">盘龙参</span>`;
let 天仙藤 = `<span style="color:orange">天仙藤</span>`;

let prescription = {
    "冰心丹": [
        {
            "color": 5,
            "prescription": [灵芝, 盘龙参, 天仙藤, 人参, 盘龙参, 凌霄花, 灵芝, 天仙藤, 灵芝],
            "explain": "练习效率＋50%",
            "duration": 60,
        },

    ],
    "清心丹": [
        {
            "color": 5,
            "prescription": [何首乌, 凌霄花, 何首乌, 天仙藤, 天仙藤, 何首乌, 盘龙参, 人参, 凌霄花],
            "explain": "学习效率＋50%",
            "duration": 60,
        }
    ],
}

// color => 绿1 蓝2 黄3 紫4 橙5
// duration => 持续 xx 分钟

console.log(JSON.stringify(prescription));

